#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_s3_bucket.terraform_state: Refreshing state... [id=terraform-state-bucket-f3b7a9c1]
aws_budgets_budget.organization_wide: Refreshing state... [id=864899865811:OrganizationWideBudget]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_budgets_budget.organization_wide will be destroyed
  # (because aws_budgets_budget.organization_wide is not in configuration)
  - resource "aws_budgets_budget" "organization_wide" {
      - account_id        = "864899865811" -> null
      - arn               = "arn:aws:budgets::864899865811:budget/OrganizationWideBudget" -> null
      - budget_type       = "COST" -> null
      - id                = "864899865811:OrganizationWideBudget" -> null
      - limit_amount      = "1.0" -> null
      - limit_unit        = "USD" -> null
      - name              = "OrganizationWideBudget" -> null
      - tags              = {} -> null
      - tags_all          = {} -> null
      - time_period_end   = "2087-06-15_00:00" -> null
      - time_period_start = "2024-09-01_00:00" -> null
      - time_unit         = "MONTHLY" -> null
        # (1 unchanged attribute hidden)

      - cost_types {
          - include_credit             = true -> null
          - include_discount           = true -> null
          - include_other_subscription = true -> null
          - include_recurring          = true -> null
          - include_refund             = true -> null
          - include_subscription       = true -> null
          - include_support            = true -> null
          - include_tax                = true -> null
          - include_upfront            = true -> null
          - use_amortized              = false -> null
          - use_blended                = false -> null
        }

      - notification {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - notification {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # aws_dynamodb_table.terraform_locks will be created
  + resource "aws_dynamodb_table" "terraform_locks" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "LockID"
      + id               = (known after apply)
      + name             = "terraform-state-lock-e2d8b0a5"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "Management"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "Terraform State Locks"
        }
      + tags_all         = {
          + "Environment" = "Management"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "Terraform State Locks"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "LockID"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # aws_s3_bucket_public_access_block.public_access will be created
  + resource "aws_s3_bucket_public_access_block" "public_access" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = "terraform-state-bucket-f3b7a9c1"
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_server_side_encryption_configuration.default will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "default" {
      + bucket = "terraform-state-bucket-f3b7a9c1"
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_s3_bucket_versioning.enabled will be created
  + resource "aws_s3_bucket_versioning" "enabled" {
      + bucket = "terraform-state-bucket-f3b7a9c1"
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 4 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @jonathanagustin, Action: `pull_request`*